Mão na massa

In [1]:
import pandas as pd

In [2]:
#Exercício 1
df1 = pd.DataFrame({'A': [4, 2, 1, 3], 'B': ['a', 'b', 'c', 'b']})
df2 = pd.DataFrame({'A': [2, 3, 5], 'C': [10, 20, 30]})

print(df1)
print(df2)

   A  B
0  4  a
1  2  b
2  1  c
3  3  b
   A   C
0  2  10
1  3  20
2  5  30

In [3]:
df1.merge(df2, on= "A", how='left')

   A  B     C
0  4  a   NaN
1  2  b  10.0
2  1  c   NaN
3  3  b  20.0

In [4]:
df1.merge(df2, on= "A", how='right')

   A    B   C
0  2    b  10
1  3    b  20
2  5  NaN  30

In [5]:
df1.merge(df2, on= "A", how='outer')

   A    B     C
0  1    c   NaN
1  2    b  10.0
2  3    b  20.0
3  4    a   NaN
4  5  NaN  30.0

In [6]:
df1.merge(df2, on= "A", how='inner')

   A  B   C
0  2  b  10
1  3  b  20

In [7]:
pd.merge(df1, df2, on= "A", how='inner')

   A  B   C
0  2  b  10
1  3  b  20

In [ ]:
#Exercício 2
df3=df1.merge(df2, on= "A", how='outer').sort_values('A').reset_index(drop=True)
df3

   A    B     C
0  1    c   NaN
1  2    b  10.0
2  3    b  20.0
3  4    a   NaN
4  5  NaN  30.0

In [ ]:
#Exercício 3
pd.concat([df1,df2], ignore_index=True)

   A     C    B
0  2  10.0  NaN
1  3  20.0  NaN
2  5  30.0  NaN
3  4   NaN    a
4  2   NaN    b
5  1   NaN    c
6  3   NaN    b

In [11]:
pd.concat([df1,df2], axis=1)

   A  B    A     C
0  4  a  2.0  10.0
1  2  b  3.0  20.0
2  1  c  5.0  30.0
3  3  b  NaN   NaN

In [12]:
#Exercício 4
df1.groupby('B')[['A']].sum()

   A
B
a  4
b  5
c  1